notes.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="notes.css" />

These are my notes from the Udemy course Complete Modern C++ (C++11/14/17)


Notas de cosas a repasar!

* Section 1 - Start Here
No notes, this section covers installing a compiler

* Section 2 - Basic Language Facilities

** <climits> & <limits.h>
climits & limits.h provide macros that represent the minimum and maximum values of a type

Example:

#+BEGIN_SRC C++
#define CHAR_BIT 8 // Number of bits in char

#define INT_MIN (-2147483647 -1) // Minimum signed int value
#define INT_MAX 2147483647 // Maximum int value
#+END_SRC

** <cfloat> & <float.h>

This files hold macros for floats & doubles range limits, Epsilon and more.

** Input/Output streams


#include <iostream>

C++ provides 2 classes for input and output

std::ostream is for output
std::istream is for input

std::cout is an object of the ostream class
std::cin is an object of the istream class


std::cin stops reading from keyboard when it encounters a whitespace
character, in order to read a whole line we need to use
std::cin.getline()

** Uniform initialization

Uniform initialization is a feature in C++ 11 that allows the usage of
a consistent syntax to initialize variables and objects ranging from
primitive type to aggregates. In other words, it introduces
brace-initialization that uses braces ({}) to enclose initializer
values.

#+BEGIN_SRC C++
int i{};     // initialized built-in type, equals to int i{0};

int j{10}; // initialized built-in type

int a[]{1, 2, 3, 4} // Aggregate initialization

X x1{}; // default constructor

X x2{1}; // Parameterized constructor;

X x4{x3}; // copy-constructor
#+END_SRC

** nullptr

Always use nullptr instead of NULL to initialize pointers

NULL is a “manifest constant” (a #define of C) that’s actually an integer that can be assigned to a pointer because of an implicit conversion.

nullptr is a keyword representing a value of self-defined type, that can convert into a pointer, but not into integers.

#+BEGIN_SRC C++
int i = NULL; // OK
int i = nullptr; // error - not a integer convertible value
int* p = NULL; //ok - int converted into pointer
int* p = nullptr; // ok
That, is important to solve an ambiguity that can arise in generic programming:
#+END_SRC

suppose you have two functions in overload:

#+BEGIN_SRC C++
void func(int x);
void func(int* x);
#+END_SRC

Now, if you call func(NULL), you are actually calling … the 1) variant, being NULL an int. But func(nullptr) will call the 2) variant, being nullptr not an int.

To avoid the risk to call one function instead of another, always use 0 if you want an integer, and nullptr if you want a pointer.
** References
Estudiar references, saberse las diferencias con un puntero!
** const
Repasar const, anotar que es y las varias formas que puede ser usado

Se puede intentar leer desde la derecha hacia la izquierda
** std::begin() & std::end() - for range loops

#+BEGIN_SRC C++
int Array[] = {1, 2, 3, 4, 5};

// begin and end are usually member functions of containers, but there are also function versions
int *Begin = std::begin(Array);
int *End = std::end(Array);

// std::begin() & std::end() are used to implement for ranged loops using pointer arithmetic

#+END_SRC
** for range loops with custom classes
If you want to use range based for loops with your custom classes you need to provide iterators for the class
** Namespaces

Using an anonimous namespace will make all the functions, classes,
data visible only on the same .cpp file, similar to static

#+BEGIN_SRC C++
namespace
{
int ThisFunction();
}
#+END_SRC

// This function is only visible on the same .cpp file as the anonymous namespace is implemented/declared.
* Section 4 - Classes and Objects

