notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-06 Mon 12:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="notes.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee8dbf0">1. Section 1 - Start Here</a></li>
<li><a href="#org10a966c">2. Section 2 - Basic Language Facilities</a>
<ul>
<li><a href="#org49dc317">2.1. &lt;climits&gt; &amp; &lt;limits.h&gt;</a></li>
<li><a href="#org27167ae">2.2. &lt;cfloat&gt; &amp; &lt;float.h&gt;</a></li>
<li><a href="#org7bf9bf9">2.3. Input/Output streams</a></li>
<li><a href="#org9dee08d">2.4. Uniform initialization</a></li>
<li><a href="#orge9efc13">2.5. nullptr</a></li>
<li><a href="#org5abb28a">2.6. References</a></li>
<li><a href="#org5967486">2.7. const</a></li>
<li><a href="#org6ad9de7">2.8. std::begin() &amp; std::end() - for range loops</a></li>
<li><a href="#org8a97d80">2.9. for range loops with custom classes</a></li>
<li><a href="#org231cee2">2.10. Namespaces</a></li>
</ul>
</li>
<li><a href="#org868579a">3. Section 4 - Classes and Objects</a>
<ul>
<li><a href="#orgf57819a">3.1. Basic principles that help us write OO programs</a></li>
<li><a href="#org24ff676">3.2. this pointer</a></li>
<li><a href="#org3bee743">3.3. Static class members</a></li>
<li><a href="#org8af684c">3.4. const/constant member functions</a></li>
<li><a href="#org7cff6f3">3.5. Copy constructors</a>
<ul>
<li><a href="#org17f7de6">3.5.1. How to tell if a class needs a custom copy constructor</a></li>
</ul>
</li>
<li><a href="#org96e8da7">3.6. Delegating constructor</a></li>
<li><a href="#org013bc86">3.7. default and delete functions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These are my notes from the Udemy course Complete Modern C++ (C++11/14/17)
</p>


<p>
Notas de cosas a repasar!
</p>

<div id="outline-container-orgee8dbf0" class="outline-2">
<h2 id="orgee8dbf0"><span class="section-number-2">1</span> Section 1 - Start Here</h2>
<div class="outline-text-2" id="text-1">
<p>
No notes, this section covers installing a compiler
</p>
</div>
</div>

<div id="outline-container-org10a966c" class="outline-2">
<h2 id="org10a966c"><span class="section-number-2">2</span> Section 2 - Basic Language Facilities</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org49dc317" class="outline-3">
<h3 id="org49dc317"><span class="section-number-3">2.1</span> &lt;climits&gt; &amp; &lt;limits.h&gt;</h3>
<div class="outline-text-3" id="text-2-1">
<p>
climits &amp; limits.h provide macros that represent the minimum and maximum values of a type
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ffd700;">#define</span> <span style="color: #4eee94;">CHAR_BIT</span> 8 <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Number of bits in char</span>

<span style="color: #ffd700;">#define</span> <span style="color: #4eee94;">INT_MIN</span> (-2147483647 -1) <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Minimum signed int value</span>
<span style="color: #ffd700;">#define</span> <span style="color: #4eee94;">INT_MAX</span> 2147483647 <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Maximum int value</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org27167ae" class="outline-3">
<h3 id="org27167ae"><span class="section-number-3">2.2</span> &lt;cfloat&gt; &amp; &lt;float.h&gt;</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This files hold macros for floats &amp; doubles range limits, Epsilon and more.
</p>
</div>
</div>

<div id="outline-container-org7bf9bf9" class="outline-3">
<h3 id="org7bf9bf9"><span class="section-number-3">2.3</span> Input/Output streams</h3>
<div class="outline-text-3" id="text-2-3">
<p>
#include &lt;iostream&gt;
</p>

<p>
C++ provides 2 classes for input and output
</p>

<p>
std::ostream is for output
std::istream is for input
</p>

<p>
std::cout is an object of the ostream class
std::cin is an object of the istream class
</p>


<p>
std::cin stops reading from keyboard when it encounters a whitespace
character, in order to read a whole line we need to use
std::cin.getline()
</p>
</div>
</div>

<div id="outline-container-org9dee08d" class="outline-3">
<h3 id="org9dee08d"><span class="section-number-3">2.4</span> Uniform initialization</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Uniform initialization is a feature in C++ 11 that allows the usage of
a consistent syntax to initialize variables and objects ranging from
primitive type to aggregates. In other words, it introduces
brace-initialization that uses braces ({}) to enclose initializer
values.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span>{};     <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">initialized built-in type, equals to int i{0};</span>

<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">j</span>{10}; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">initialized built-in type</span>

<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">a</span>[]{1, 2, 3, 4} <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Aggregate initialization</span>

<span style="color: #98f5ff;">X</span> <span style="color: #4eee94;">x1</span>{}; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">default constructor</span>

<span style="color: #98f5ff;">X</span> <span style="color: #4eee94;">x2</span>{1}; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Parameterized constructor;</span>

<span style="color: #98f5ff;">X</span> <span style="color: #4eee94;">x4</span>{x3}; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">copy-constructor</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9efc13" class="outline-3">
<h3 id="orge9efc13"><span class="section-number-3">2.5</span> nullptr</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Always use nullptr instead of NULL to initialize pointers
</p>

<p>
NULL is a “manifest constant” (a #define of C) that’s actually an integer that can be assigned to a pointer because of an implicit conversion.
</p>

<p>
nullptr is a keyword representing a value of self-defined type, that can convert into a pointer, but not into integers.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = <span style="color: #a2cd5a;">NULL</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">OK</span>
<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = <span style="color: #a2cd5a;">nullptr</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">error - not a integer convertible value</span>
<span style="color: #98f5ff;">int</span>* <span style="color: #4eee94;">p</span> = <span style="color: #a2cd5a;">NULL</span>; <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">ok - int converted into pointer</span>
<span style="color: #98f5ff;">int</span>* <span style="color: #4eee94;">p</span> = <span style="color: #a2cd5a;">nullptr</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">ok</span>
That, is important to solve an ambiguity that can arise in <span style="color: #98f5ff;">generic</span> <span style="color: #4eee94;">programming</span>:
</pre>
</div>

<p>
suppose you have two functions in overload:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #98f5ff;">void</span> <span style="color: #daa520;">func</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">x</span>);
<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">func</span>(<span style="color: #98f5ff;">int</span>* <span style="color: #4eee94;">x</span>);
</pre>
</div>

<p>
Now, if you call func(NULL), you are actually calling … the 1) variant, being NULL an int. But func(nullptr) will call the 2) variant, being nullptr not an int.
</p>

<p>
To avoid the risk to call one function instead of another, always use 0 if you want an integer, and nullptr if you want a pointer.
</p>
</div>
</div>
<div id="outline-container-org5abb28a" class="outline-3">
<h3 id="org5abb28a"><span class="section-number-3">2.6</span> References</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Estudiar references, saberse las diferencias con un puntero!
</p>
</div>
</div>
<div id="outline-container-org5967486" class="outline-3">
<h3 id="org5967486"><span class="section-number-3">2.7</span> const</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Repasar const, anotar que es y las varias formas que puede ser usado
</p>

<p>
Se puede intentar leer desde la derecha hacia la izquierda
</p>
</div>
</div>
<div id="outline-container-org6ad9de7" class="outline-3">
<h3 id="org6ad9de7"><span class="section-number-3">2.8</span> std::begin() &amp; std::end() - for range loops</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Array</span>[] = {1, 2, 3, 4, 5};

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">begin and end are usually member functions of containers, but there are also function versions</span>
<span style="color: #98f5ff;">int</span> *<span style="color: #4eee94;">Begin</span> = <span style="color: #a2cd5a;">std</span>::begin(Array);
<span style="color: #98f5ff;">int</span> *<span style="color: #4eee94;">End</span> = <span style="color: #a2cd5a;">std</span>::end(Array);

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">std::begin() &amp; std::end() are used to implement for ranged loops using pointer arithmetic</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org8a97d80" class="outline-3">
<h3 id="org8a97d80"><span class="section-number-3">2.9</span> for range loops with custom classes</h3>
<div class="outline-text-3" id="text-2-9">
<p>
If you want to use range based for loops with your custom classes you need to provide iterators for the class
</p>
</div>
</div>
<div id="outline-container-org231cee2" class="outline-3">
<h3 id="org231cee2"><span class="section-number-3">2.10</span> Namespaces</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Using an anonimous namespace will make all the functions, classes,
data visible only on the same .cpp file, similar to static
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #00bfff;">namespace</span>
{
<span style="color: #98f5ff;">int</span> <span style="color: #daa520;">ThisFunction</span>();
}
</pre>
</div>

<p>
// This function is only visible on the same .cpp file as the anonymous namespace is implemented/declared.
</p>
</div>
</div>
</div>
<div id="outline-container-org868579a" class="outline-2">
<h2 id="org868579a"><span class="section-number-2">3</span> Section 4 - Classes and Objects</h2>
<div class="outline-text-2" id="text-3">
</div>
