notes.org
** Basic principles that help us write OO programs
- Abstraction
- Encapsulation
- Inheritance
- Polymorphism
** this pointer

It's a hidden pointer that's passed to every member function

Points to the object that invoked the member function

** Static class members

static variables
- use static as a qualifier for the variable, ex: static int Integer;
- Static variables are not part of the object, they belong to the class.
- Only one copy exists across all objects of the same class.
- They cannot be initialized inside the class
- They have to be defined outside the class for initialization
- The compiler by default assigns 0 as a default value

#+BEGIN_SRC C++
class car
{
private:
    static int ExampleVariable;
};

// In the class .cpp file initialize the static variable like this:
int car::ExampleVariable = 10; // If nothing is assigned, the compiler defaults the variable to 0
#+END_SRC

static functions

If we dont have any objects but we still need to access the static variable, we can create static member functions.

- assign the static qualifier to a function
- The also belong to a class and not objects
- They do not recieve the this pointer
- They cannot access non-static members of the class since it does not recieve the this pointer
- They can be invoked directly through the class name

#+BEGIN_SRC C++
class car
{
    static void ExampleFunction();
};

// in car.cpp

void car::ExampleFunction()
{
    // Do something
}
#+END_SRC

** const/constant member functions
- const member functions cannot change the value of any member variable
- they are qualified with the const keyword
- Declaration and definition are qualified
- useful for creating read-only functions
- const objects can invoke only const member functions
- we should add const to member functions that do not change the object's state

#+BEGIN_SRC C++
const Car HondaFit; // Honda Fit can only invoke const member functions

class Car
{
    // const is added to the end of the statement, it also needs to be added in function definition
    void ConstantMemberFunction() const;

};

// Car.cpp

void Car::ConstantMemberFunction() const
{
    // Do something
}
#+END_SRC

** Copy constructors

- A copy constructor creates a copy of the object's state into another object
- If no copy constructor is explicitdly defined, C++ creates one that simply copies values.
- Custom copy constructors might be needed when the class has pointer
  members and the two objects should not hold the same ptr.
- Default pointer member variables may crash the application while
  creating a shallow copy of the member pointers, that's one reason we
  may need custom copy constructors

#+BEGIN_SRC C++
class Integer
{
    int *m_pInt;
public:
    Integer();
    Integer(int Value);
    int GetValue() const;
    void SetValue(int Value);
    ~Integer();
};

Integer::Integer()
{
    m_pInt = new int(0);
}

Integer::Integer(int Value)
{
    m_pInt = new int(Value);
}

int Integer::GetValue() const
{
    return *m_pInt;
}

void Integer::SetValue(int Value)
{
    *m_pInt = Value;
}

Integer::~Integer()
{
    delete m_pInt;
}

// NOTE: This function creates a copy constructor because the object parameter is passed by value
void Print(Integer i)
{
    std::cout << i << std::endl;
}

// NOTE: This function makes C++ create a copy constructor because it returns by value
Integer Add(int x, int y)
{
    return Integer(x + y);
}

int main()
{

    Integer i(5);
    Integer i2(i); // This causes C++ to generate a default copy constructor for our class

    i2 = i; // This also invokes a copy constructor
    std::cout << i.GetValue() << std::endl;

    return 0;
}

#+END_SRC

#+BEGIN_SRC C++
// How to create a custom copy constructor

class Integer
{
    int *m_pInt;
public:
    // This is how we declare a copy constructor, it MUST pass object by reference
    Integer(Integer &Obj);
};

Integer::Integer(Integer &Obj)
{
    // The following is called a "Deep Copy" of a pointer. A shallow copy just copies the address.
    m_pInt = new int;
    *m_pInt = Obj.m_pInt;

}

#+END_SRC

*** How to tell if a class needs a custom copy constructor

**** The rule of 3
The Rule of Three states that if a type ever needs to have a
user-defined copy constructor, copy assignment operator, or
destructor, then it must have all three.

