notes.html
<div id="outline-container-orgf57819a" class="outline-3">
<h3 id="orgf57819a"><span class="section-number-3">3.1</span> Basic principles that help us write OO programs</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Abstraction</li>
<li>Encapsulation</li>
<li>Inheritance</li>
<li>Polymorphism</li>
</ul>
</div>
</div>
<div id="outline-container-org24ff676" class="outline-3">
<h3 id="org24ff676"><span class="section-number-3">3.2</span> this pointer</h3>
<div class="outline-text-3" id="text-3-2">
<p>
It's a hidden pointer that's passed to every member function
</p>

<p>
Points to the object that invoked the member function
</p>
</div>
</div>

<div id="outline-container-org3bee743" class="outline-3">
<h3 id="org3bee743"><span class="section-number-3">3.3</span> Static class members</h3>
<div class="outline-text-3" id="text-3-3">
<p>
static variables
</p>
<ul class="org-ul">
<li>use static as a qualifier for the variable, ex: static int Integer;</li>
<li>Static variables are not part of the object, they belong to the class.</li>
<li>Only one copy exists across all objects of the same class.</li>
<li>They cannot be initialized inside the class</li>
<li>They have to be defined outside the class for initialization</li>
<li>The compiler by default assigns 0 as a default value</li>
</ul>

<div class="org-src-container">
<pre class="src src-C+++">class car
{
private:
    static int ExampleVariable;
};

// In the class .cpp file initialize the static variable like this:
int car::ExampleVariable = 10; // If nothing is assigned, the compiler defaults the variable to 0
</pre>
</div>

<p>
static functions
</p>

<p>
If we dont have any objects but we still need to access the static variable, we can create static member functions.
</p>

<ul class="org-ul">
<li>assign the static qualifier to a function</li>
<li>The also belong to a class and not objects</li>
<li>They do not recieve the this pointer</li>
<li>They cannot access non-static members of the class since it does not recieve the this pointer</li>
<li>They can be invoked directly through the class name</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">car</span>
{
    <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">ExampleFunction</span>();
};

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">in car.cpp</span>

<span style="color: #98f5ff;">void</span> <span style="color: #a2cd5a;">car</span>::<span style="color: #daa520;">ExampleFunction</span>()
{
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Do something</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8af684c" class="outline-3">
<h3 id="org8af684c"><span class="section-number-3">3.4</span> const/constant member functions</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>const member functions cannot change the value of any member variable</li>
<li>they are qualified with the const keyword</li>
<li>Declaration and definition are qualified</li>
<li>useful for creating read-only functions</li>
<li>const objects can invoke only const member functions</li>
<li>we should add const to member functions that do not change the object's state</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #00bfff;">const</span> <span style="color: #98f5ff;">Car</span> <span style="color: #4eee94;">HondaFit</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Honda Fit can only invoke const member functions</span>

<span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Car</span>
{
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">const is added to the end of the statement, it also needs to be added in function definition</span>
    <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">ConstantMemberFunction</span>() <span style="color: #00bfff;">const</span>;

};

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Car.cpp</span>

<span style="color: #98f5ff;">void</span> <span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">ConstantMemberFunction</span>() <span style="color: #00bfff;">const</span>
{
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Do something</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7cff6f3" class="outline-3">
<h3 id="org7cff6f3"><span class="section-number-3">3.5</span> Copy constructors</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>A copy constructor creates a copy of the object's state into another object</li>
<li>If no copy constructor is explicitdly defined, C++ creates one that simply copies values.</li>
<li>Custom copy constructors might be needed when the class has pointer
members and the two objects should not hold the same ptr.</li>
<li>Default pointer member variables may crash the application while
creating a shallow copy of the member pointers, that's one reason we
may need custom copy constructors</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Integer</span>
{
    <span style="color: #98f5ff;">int</span> *<span style="color: #4eee94;">m_pInt</span>;
<span style="color: #00bfff;">public</span>:
    <span style="color: #daa520;">Integer</span>();
    <span style="color: #daa520;">Integer</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Value</span>);
    <span style="color: #98f5ff;">int</span> <span style="color: #daa520;">GetValue</span>() <span style="color: #00bfff;">const</span>;
    <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">SetValue</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Value</span>);
    ~<span style="color: #daa520;">Integer</span>();
};

<span style="color: #a2cd5a;">Integer</span>::<span style="color: #daa520;">Integer</span>()
{
    m_pInt = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">int</span>(0);
}

<span style="color: #a2cd5a;">Integer</span>::<span style="color: #daa520;">Integer</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Value</span>)
{
    m_pInt = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">int</span>(Value);
}

<span style="color: #98f5ff;">int</span> <span style="color: #a2cd5a;">Integer</span>::<span style="color: #daa520;">GetValue</span>() <span style="color: #00bfff;">const</span>
{
    <span style="color: #00bfff;">return</span> *m_pInt;
}

<span style="color: #98f5ff;">void</span> <span style="color: #a2cd5a;">Integer</span>::<span style="color: #daa520;">SetValue</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Value</span>)
{
    *m_pInt = Value;
}

<span style="color: #a2cd5a;">Integer</span>::~<span style="color: #daa520;">Integer</span>()
{
    <span style="color: #00bfff;">delete</span> m_pInt;
}

<span style="color: #7f7f7f;">// </span><span style="color: #006400; font-weight: bold;">NOTE</span><span style="color: #7f7f7f;">: This function creates a copy constructor because the object parameter is passed by value</span>
<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">Print</span>(<span style="color: #98f5ff;">Integer</span> <span style="color: #4eee94;">i</span>)
{
    <span style="color: #a2cd5a;">std</span>::cout &lt;&lt; i &lt;&lt; <span style="color: #a2cd5a;">std</span>::endl;
}

<span style="color: #7f7f7f;">// </span><span style="color: #006400; font-weight: bold;">NOTE</span><span style="color: #7f7f7f;">: This function makes C++ create a copy constructor because it returns by value</span>
<span style="color: #98f5ff;">Integer</span> <span style="color: #daa520;">Add</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">x</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">y</span>)
{
    <span style="color: #00bfff;">return</span> Integer(x + y);
}

<span style="color: #98f5ff;">int</span> <span style="color: #daa520;">main</span>()
{

    <span style="color: #98f5ff;">Integer</span> <span style="color: #4eee94;">i</span>(5);
    <span style="color: #98f5ff;">Integer</span> <span style="color: #4eee94;">i2</span>(i); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This causes C++ to generate a default copy constructor for our class</span>

    i2 = i; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This also invokes a copy constructor</span>
    <span style="color: #a2cd5a;">std</span>::cout &lt;&lt; i.GetValue() &lt;&lt; <span style="color: #a2cd5a;">std</span>::endl;

    <span style="color: #00bfff;">return</span> 0;
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">How to create a custom copy constructor</span>

<span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Integer</span>
{
    <span style="color: #98f5ff;">int</span> *<span style="color: #4eee94;">m_pInt</span>;
<span style="color: #00bfff;">public</span>:
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This is how we declare a copy constructor, it MUST pass object by reference</span>
    <span style="color: #daa520;">Integer</span>(<span style="color: #98f5ff;">Integer</span> &amp;<span style="color: #4eee94;">Obj</span>);
};

<span style="color: #a2cd5a;">Integer</span>::<span style="color: #daa520;">Integer</span>(<span style="color: #98f5ff;">Integer</span> &amp;<span style="color: #4eee94;">Obj</span>)
{
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">The following is called a "Deep Copy" of a pointer. A shallow copy just copies the address.</span>
    m_pInt = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">int</span>;
    *m_pInt = Obj.m_pInt;

}

</pre>
</div>
</div>

<div id="outline-container-org17f7de6" class="outline-4">
<h4 id="org17f7de6"><span class="section-number-4">3.5.1</span> How to tell if a class needs a custom copy constructor</h4>
<div class="outline-text-4" id="text-3-5-1">
</div>
<ol class="org-ol">
<li><a id="org250ae04"></a>The rule of 3<br />
<div class="outline-text-5" id="text-3-5-1-1">
<p>
The Rule of Three states that if a type ever needs to have a
user-defined copy constructor, copy assignment operator, or
destructor, then it must have all three.
</p>
</div>
</li>
</ol>
</div>
</div>
