notes.org
** Delegating constructor

Delegating constructor are constructors that call other constructors.

Suppose we have a few constructors that contain repeated code. That
may become a source of bugs, so the idea is to create a single
constructor that does the shared code and call that constructor from
the other constructors.

#+BEGIN_SRC C++

  class Car
  {
  public:
      Car::Car();
      Car::Car(float Fuel);
      Car::Car(float Fuel, int Passengers);
  private:
      int Passengers;
      float Amount;
  };

  Car::Car : Car(0) // The default constructor invokes the constructor
		    // with 1 parameter, the constructor invoked runs
		    // first. In this case the constructor with the 2
		    // parameters is the one that gets executed first
  {

  }

  Car::Car(float amount) : Car(amount, 0) // The constructor with 1
					  // parameter invokes the
					  // constructor with 2
					  // parameters
  {
  }

  Car::Car(float amount, int passengers) // This constructor holds the
					 // shared code between
					 // constructors. Now it lives
					 // in only one place
  {
      Amount = amount;
      Passengers = passengers;
  }


#+END_SRC

** default and delete functions

In C++11 you can request the compiler to create default implementation
of constructor by using the default keyword.

You can only use the default keyword with those functions that can be created by the compiler.
- Constructors
- Copy Constructors
- = operator

#+BEGIN_SRC C++

class Integer
{
    int m_Value{0};
public:
    Integer() = default; // This request the compiler to create a default constructor
    Integer(const Integer &Object) = default; // Request the compiler to generate a default copy constructor
};

#+END_SRC

the delete keyword is used to tell the compiler not to generate
functions.

#+BEGIN_SRC C++

  class Integer
  {
      int m_Value{0};
  public:
      Integer(const Integer &Object) = delete; // This request the compiler to not generate a copy constructor.
  };

  void main()
  {
      Integer i1;
      Integer i2(i1); // This will not compile since we prohibited a copy constructor to be used.
  }

#+END_SRC

Unlike default, delete can be used in any kind of function.
#+BEGIN_SRC C++

  void Test(int Input)
  {
      cout << Input;
  }

  void Test(float Input) = delete;


  void main()
  {
  int A = 1;
  float B = 10.0f;
  Test(B); // Without using the keyword delete, The parameter would be
	   // converted to int and the int function called. Now this is a
	   // compile time error.
  }

#+END_SRC
