notes.html

<div id="outline-container-org96e8da7" class="outline-3">
<h3 id="org96e8da7"><span class="section-number-3">3.6</span> Delegating constructor</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Delegating constructor are constructors that call other constructors.
</p>

<p>
Suppose we have a few constructors that contain repeated code. That
may become a source of bugs, so the idea is to create a single
constructor that does the shared code and call that constructor from
the other constructors.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Car</span>
{
<span style="color: #00bfff;">public</span>:
    <span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">Car</span>();
    <span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">Car</span>(<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">Fuel</span>);
    <span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">Car</span>(<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">Fuel</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Passengers</span>);
<span style="color: #00bfff;">private</span>:
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Passengers</span>;
    <span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">Amount</span>;
};

<span style="color: #a2cd5a;">Car</span>::Car : Car(0) <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">The default constructor invokes the constructor</span>
          <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">with 1 parameter, the constructor invoked runs</span>
          <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">first. In this case the constructor with the 2</span>
          <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">parameters is the one that gets executed first</span>
{

}

<span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">Car</span>(<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">amount</span>) : Car(amount, 0) <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">The constructor with 1</span>
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">parameter invokes the</span>
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">constructor with 2</span>
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">parameters</span>
{
}

<span style="color: #a2cd5a;">Car</span>::<span style="color: #daa520;">Car</span>(<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">amount</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">passengers</span>) <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This constructor holds the</span>
                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">shared code between</span>
                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">constructors. Now it lives</span>
                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">in only one place</span>
{
    Amount = amount;
    Passengers = passengers;
}


</pre>
</div>
</div>
</div>

<div id="outline-container-org013bc86" class="outline-3">
<h3 id="org013bc86"><span class="section-number-3">3.7</span> default and delete functions</h3>
<div class="outline-text-3" id="text-3-7">
<p>
In C++11 you can request the compiler to create default implementation
of constructor by using the default keyword.
</p>

<p>
You can only use the default keyword with those functions that can be created by the compiler.
</p>
<ul class="org-ul">
<li>Constructors</li>
<li>Copy Constructors</li>
<li>= operator</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Integer</span>
{
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">m_Value</span>{0};
<span style="color: #00bfff;">public</span>:
    <span style="color: #daa520;">Integer</span>() = <span style="color: #00bfff;">default</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This request the compiler to create a default constructor</span>
    <span style="color: #daa520;">Integer</span>(<span style="color: #00bfff;">const</span> <span style="color: #98f5ff;">Integer</span> &amp;<span style="color: #4eee94;">Object</span>) = <span style="color: #00bfff;">default</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Request the compiler to generate a default copy constructor</span>
};

</pre>
</div>

<p>
the delete keyword is used to tell the compiler not to generate
functions.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Integer</span>
{
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">m_Value</span>{0};
<span style="color: #00bfff;">public</span>:
    <span style="color: #daa520;">Integer</span>(<span style="color: #00bfff;">const</span> <span style="color: #98f5ff;">Integer</span> &amp;<span style="color: #4eee94;">Object</span>) = <span style="color: #00bfff;">delete</span>; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This request the compiler to not generate a copy constructor.</span>
};

<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span>()
{
    <span style="color: #98f5ff;">Integer</span> <span style="color: #4eee94;">i1</span>;
    <span style="color: #98f5ff;">Integer</span> <span style="color: #4eee94;">i2</span>(i1); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">This will not compile since we prohibited a copy constructor to be used.</span>
}

</pre>
</div>

<p>
Unlike default, delete can be used in any kind of function.
</p>
<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">Test</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">Input</span>)
{
    cout &lt;&lt; Input;
}

<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">Test</span>(<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">Input</span>) = <span style="color: #00bfff;">delete</span>;


<span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span>()
{
<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">A</span> = 1;
<span style="color: #98f5ff;">float</span> <span style="color: #4eee94;">B</span> = 10.0f;
Test(B); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Without using the keyword delete, The parameter would be</span>
     <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">converted to int and the int function called. Now this is a</span>
     <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">compile time error.</span>
}

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-06-06 Mon 12:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
